package main.SOLID;

public class Introduction {
    /*


    SOLID
    SRP Single Responsibility   единая ответственность. Должен выполнять однк функцию или одну причину, чтоб его можно было изменить.
    OCP Open/Closed             Открытый для расширения, но закрытый для модификаций
    LSP Liskov Substitution     Замена. Вместо батькивських классов могут использоваться наследники и код будет рабочим
    ISP Interface Segregation   Сегрегация интерфейса. Разделение интерфейсов. Лучше много маленьких, чем один большой.
    DI  Dependency Inversion    зависимость инверсия. Модули верхних уровней не должны зависеть от нижних. Абстракция не должна зависеть от имплементации.


    PACKAGES
    DAO      Data access object      Связывает приложение с базой данных.
    SERVICE  В сервисе должна выполнятся бизнес логика
    MODEL    Классы объектов
    VIEW     Визуализация


     */
}
